/**************************************************************************************
 *  Copyright (c) Artificial Intelligence Infinity.
 *  Filename: stdIoWrap.c 
 *  Description: unix 标准 IO API函数封装文件 
 *  Author: caoyun
 *  Create:2010-01-25 
 *  Modification history:
 *
 *
 **************************************************************************************/ 

/*=======================================================
 *				基本　TCP API　Wrapper
 * ====================================================*/

